app/controllers/attendees_controller.rb

INSERT INTO "attendees" ("name", "email", "phonenumber", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Jomba"], ["email", "jomba@gmail.com"], ["phonenumber", "15432545"], ["event_id", 4], ["created_at", "2022-10-12 09:56:19.173231"], ["updated_at", "2022-10-12 09:56:19.173231"]]
---
def create
    attendee=Attendee.create!(attendee_params)

SELECT "attendees".* FROM "attendees"
---
def index
    attendee=Attendee.all