app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
    def index
        r=Event.all

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
    def show
        r=Event.find(params[:id])

INSERT INTO "events" ("eventname", "fee", "location", "date", "slots", "details", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        event = Event.create!(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "events" SET "details" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["details", "Event ya mabazus"], ["updated_at", "2022-10-13 17:00:30.001606"], ["id", 40]]
---
    def update
        event = Event.find_by(id: params[:id])
        event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 42]]
---
    def destroy
        event =Event.find(params[:id])
        event.destroy